
AtlasLootClassicDB = {
	["profileKeys"] = {
		["头哥 - 觅心者"] = "头哥 - 觅心者",
		["Fk - 木喉要塞"] = "Fk - 木喉要塞",
		["聪明丢 - 觅心者"] = "聪明丢 - 觅心者",
		["狗逼 - 觅心者"] = "狗逼 - 觅心者",
		["Mhjjm - 布鲁"] = "Mhjjm - 布鲁",
	},
	["global"] = {
		["__addonrevision"] = 1020003,
	},
	["profiles"] = {
		["头哥 - 觅心者"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					-5.187299029785210e-05, -- [4]
					0, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"WailingCaverns", -- [2]
					8, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["Fk - 木喉要塞"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					-5.187299029785210e-05, -- [4]
					0, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"WailingCaverns", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["聪明丢 - 觅心者"] = {
		},
		["狗逼 - 觅心者"] = {
			["minimap"] = {
				["minimapPos"] = 174.207525390171,
			},
		},
		["Mhjjm - 布鲁"] = {
		},
	},
}
