
HandyNotesDB = {
	["profileKeys"] = {
		["肉比 - 觅心者"] = "肉比 - 觅心者",
		["石中盐 - 觅心者"] = "石中盐 - 觅心者",
		["狗逼 - 觅心者"] = "狗逼 - 觅心者",
		["Fk - 木喉要塞"] = "Fk - 木喉要塞",
		["聪明丢 - 觅心者"] = "聪明丢 - 觅心者",
		["头哥 - 觅心者"] = "头哥 - 觅心者",
		["葱姜蒜 - 觅心者"] = "葱姜蒜 - 觅心者",
		["Mhjjm - 布鲁"] = "Mhjjm - 布鲁",
	},
	["profiles"] = {
		["肉比 - 觅心者"] = {
		},
		["石中盐 - 觅心者"] = {
		},
		["狗逼 - 觅心者"] = {
		},
		["Fk - 木喉要塞"] = {
		},
		["聪明丢 - 觅心者"] = {
		},
		["头哥 - 觅心者"] = {
		},
		["葱姜蒜 - 觅心者"] = {
		},
		["Mhjjm - 布鲁"] = {
		},
	},
}
HandyNotes_HandyNotesDB = {
	["profileKeys"] = {
		["肉比 - 觅心者"] = "肉比 - 觅心者",
		["石中盐 - 觅心者"] = "石中盐 - 觅心者",
		["狗逼 - 觅心者"] = "狗逼 - 觅心者",
		["Fk - 木喉要塞"] = "Fk - 木喉要塞",
		["聪明丢 - 觅心者"] = "聪明丢 - 觅心者",
		["头哥 - 觅心者"] = "头哥 - 觅心者",
		["葱姜蒜 - 觅心者"] = "葱姜蒜 - 觅心者",
		["Mhjjm - 布鲁"] = "Mhjjm - 布鲁",
	},
	["profiles"] = {
		["肉比 - 觅心者"] = {
		},
		["石中盐 - 觅心者"] = {
		},
		["狗逼 - 觅心者"] = {
		},
		["Fk - 木喉要塞"] = {
		},
		["聪明丢 - 觅心者"] = {
		},
		["头哥 - 觅心者"] = {
		},
		["葱姜蒜 - 觅心者"] = {
		},
		["Mhjjm - 布鲁"] = {
		},
	},
}
