
_detalhes_global = {
	["npcid_pool"] = {
		[0] = "柠檬头",
		[8156] = "未知目标 <安图苏尔>",
		[4094] = "加拉克斥候",
		[4096] = "加拉克逐风者",
		[2054] = "病怏怏的难民",
		[4112] = "砂齿歹徒",
		[4116] = "砂齿勘探员",
		[4120] = "雷鸣岩石元素",
		[2064] = "议员哈尔丁",
		[4128] = "乱齿捕猎者",
		[7209] = "未知目标 <黑曜石哨兵>",
		[12396] = "末日守卫指挥官",
		[3115] = "尘风鹰身人",
		[4196] = "异种蝎群",
		[3125] = "巨钳蝎",
		[3127] = "毒尾蝎",
		[3131] = "闪电蜥蜴",
		[1791] = "被奴役的食尸鬼",
		[11075] = "护锅者拜尔摩",
		[1059] = "残忍的安纳希克",
		[1060] = "死灵莫格",
		[1061] = "甘祖拉恩",
		[7309] = "土灵管理者",
		[2680] = "邪枝狼崽",
		[4248] = "杂毛土狼",
		[7321] = "石窟织炎者",
		[2681] = "邪枝巨狼",
		[7329] = "枯萎野猪人守卫",
		[4264] = "深苔雌蜘蛛 <深苔幼蛛>",
		[7337] = "亡首通灵师",
		[7341] = "骷髅冰霜法师",
		[7345] = "碎骨统帅",
		[7349] = "墓穴魔",
		[7353] = "寒冰之灵",
		[7357] = "火眼莫德雷斯",
		[4292] = "血色保卫者",
		[12676] = "沙普塔隆",
		[4300] = "血色巫师",
		[4304] = "血色捕猎犬",
		[4308] = "自由的幽魂",
		[2648] = "邪枝精英卫兵",
		[1081] = "泥沼之王",
		[6366] = "库尔森奴隶",
		[2646] = "邪枝饮血者",
		[7397] = "土灵凿石者",
		[1085] = "老年荆棘谷猛虎",
		[7405] = "致命的裂隙沙漠蝎",
		[2647] = "邪枝噬魂者",
		[4344] = "尘泥杂斑鳄鱼",
		[2692] = "高原斥候",
		[4352] = "血沼尖啸龙",
		[2645] = "邪枝暗影猎手",
		[10758] = "恐怖图腾强盗",
		[3715] = "怒尾海巫",
		[701] = "血顶秘法师",
		[1095] = "风险投资公司经理",
		[12836] = "游荡的守护古树",
		[6426] = "痛苦的死者",
		[1098] = "守夜人摩兰特",
		[1099] = "守夜人吉尔文",
		[4392] = "腐蚀性的沼泽软泥怪",
		[5419] = "晶鳞蜥蜴",
		[3225] = "堕落的杂斑野猪",
		[2643] = "邪枝狂战士",
		[10896] = "阿纳克·恐怖图腾",
		[4412] = "暗牙爬行者",
		[7796] = "耐克鲁姆",
		[4420] = "主宰拉姆塔斯",
		[4424] = "阿格姆",
		[3239] = "电角蜥蜴",
		[3241] = "狮王闯尼玛贵",
		[4436] = "剃刀沼泽卫兵",
		[3245] = "暴躁的平原陆行鸟",
		[6490] = "永醒的艾希尔",
		[3249] = "巨型雷鹰",
		[3251] = "异种幼蝎",
		[2926] = "银鬃捕猎者",
		[4460] = "黑腮首领",
		[2639] = "邪枝掷斧者",
		[4468] = "玉石淤泥怪",
		[3261] = "刺背织棘者",
		[3263] = "刺背地卜师",
		[3265] = "钢鬃猎手",
		[3267] = "钢鬃寻水者",
		[4466] = "邪枝割颅者",
		[2248] = "洞穴雪人",
		[3273] = "科卡尔召雷师",
		[4500] = "莫格穆洛克大王",
		[2254] = "破碎岭虐待者",
		[2242] = "辛迪加间谍",
		[4512] = "腐烂的阿迦玛",
		[4516] = "亡首专家",
		[4520] = "剃刀沼泽地占师",
		[2264] = "希尔斯布莱德裁缝",
		[4528] = "石行者",
		[4532] = "剃刀沼泽兽王",
		[8636] = "守护者莫塔加亚",
		[4540] = "血色僧侣",
		[2274] = "暴怒的斯坦利",
		[4548] = "钢齿土狼",
		[4467] = "邪枝占卜者",
		[10717] = "时光寄生虫",
		[6606] = "监工格里比",
		[8567] = "暴食者",
		[1144] = "莫什奥格巫医",
		[7273] = "加兹瑞拉",
		[4437] = "剃刀沼泽守卫",
		[4692] = "恐怖飞扑者",
		[6906] = "巴尔洛戈",
		[575] = "火元素",
		[1150] = "淡水鳄",
		[1151] = "海鳄",
		[1152] = "钳嘴鳄鱼",
		[3461] = "绿洲钳嘴龟",
		[3455] = "炮兵维桑恩",
		[2358] = "达拉然召唤师",
		[3755] = "萨维亚魔仆",
		[7873] = "剃刀沼泽护卫者",
		[4624] = "藏宝海湾地精卫兵",
		[5798] = "索拉·羽月",
		[4632] = "科卡尔半人马",
		[4636] = "科卡尔队长",
		[2734] = "山脊雄豹",
		[4280] = "血色医师",
		[2422] = "戈洛姆斯",
		[2428] = "狱卒玛尔根",
		[4656] = "玛洛迪虐待者",
		[2332] = "瓦德雷·莫莱",
		[4664] = "火刃劫掠者",
		[2716] = "火烟猎龙者",
		[4672] = "怨怒魔仆",
		[4676] = "次级地狱火",
		[7057] = "未知目标",
		[2344] = "丹加洛克巡山人",
		[3457] = "钢鬃捕猎者",
		[2348] = "老食苔蛛",
		[2350] = "森林食苔蛛",
		[3375] = "巴尔丹工头",
		[3377] = "巴尔丹火枪手",
		[2356] = "老灰熊",
		[3381] = "南海歹徒",
		[2360] = "希尔斯布莱德雇农",
		[3385] = "塞拉摩水兵",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[4728] = "砂腭蜥蜴",
		[9456] = "督军克罗姆扎",
		[3393] = "法莫斯队长",
		[2372] = "泥嘴豺狼人",
		[3397] = "科卡尔战士",
		[595] = "血顶猎人",
		[1190] = "野猪",
		[4657] = "玛洛迪逐风者",
		[1192] = "胖胖的小猪佩奇",
		[597] = "血顶狂战士",
		[2386] = "南海镇卫兵",
		[1195] = "森林潜伏者",
		[5799] = "汉娜·刃叶",
		[3415] = "雌性草原狮",
		[4635] = "科卡尔逐风者",
		[4788] = "腐根萨特",
		[2894] = "石窟萨满祭司",
		[7865] = "蛮锤哨兵",
		[3425] = "草原徘徊者",
		[2404] = "铁匠维林坦",
		[12677] = "萨杜布拉",
		[4812] = "暮光寻知者",
		[5839] = "黑铁地质学家",
		[4820] = "盲光先知",
		[7033] = "火腹食人魔",
		[1008] = "混血藓皮豺狼人",
		[4832] = "梦游者克尔里斯",
		[5616] = "废土窃贼",
		[3445] = "鲁格维兹主管",
		[4844] = "暗炉勘探员",
		[4848] = "暗炉暗法师",
		[4852] = "石窟智者",
		[4856] = "石窟猎手",
		[4860] = "石头管理者",
		[6910] = "鲁维罗什",
		[3459] = "钢鬃战士",
		[4872] = "黑曜石傀儡",
		[5998] = "守望堡工头",
		[2572] = "枯须狗头人",
		[3467] = "巴隆·朗绍尔",
		[288] = "基特斯",
		[2448] = "书记员赫拉斯·怀特斯蒂德",
		[1114] = "丛林大猩猩",
		[3475] = "埃其亚基",
		[1108] = "迷雾谷猩猩",
		[2266] = "希尔斯布莱德农夫",
		[4813] = "暮光暗法师",
		[6035] = "剃刀沼泽捕猎者",
		[3825] = "幽爪前锋",
		[2252] = "破碎岭食人魔",
		[2466] = "巡山人格拉盖姆",
		[2468] = "巡山人沙尔",
		[3771] = "冷心唤魔者",
		[628] = "黑色破坏者",
		[3255] = "赤鳞尖啸龙",
		[1082] = "盐齿鳄鱼",
		[7023] = "黑曜石哨兵",
		[3503] = "异种护卫者 <天天叨逼叨>",
		[4440] = "剃刀沼泽图腾师",
		[10943] = "腐朽的守护者",
		[11576] = "旋风撕裂者",
		[688] = "石喉蜥蜴",
		[7022] = "毒鞭蝎",
		[3765] = "冷心萨特",
		[7030] = "暗炉地质学家",
		[2742] = "暗炉吟唱者",
		[687] = "丛林捕猎者",
		[4289] = "血色招魂师",
		[3757] = "萨维亚招魔师",
		[4284] = "血色预言师",
		[3529] = "月怒盔甲师",
		[3531] = "月怒裁缝",
		[5912] = "变异精灵龙",
		[11788] = "岩石虫",
		[6047] = "水中护卫",
		[4428] = "亡语者贾格巴",
		[7078] = "裂隙沙漠蝎",
		[6427] = "鬼魅幻影",
		[4863] = "玉脊蜥蜴",
		[672] = "劈颅逐灵者",
		[5048] = "无毒飞蛇",
		[2718] = "火烟萨满祭司",
		[5056] = "变异尖牙风蛇",
		[3989] = "风险投资公司樵夫",
		[6087] = "阿斯特兰纳哨兵",
		[2536] = "火柴棍乔乔",
		[1270] = "恶臭的食尸鬼",
		[2540] = "未知目标 <达拉然保卫者>",
		[12876] = "阿奎尼斯男爵",
		[681] = "荆棘谷猛虎幼崽",
		[6111] = "火焰新星图腾 II <石窟萨满祭司>",
		[2548] = "尼哈鲁船长",
		[2550] = "斯蒂沃特船长",
		[2552] = "枯木巨魔",
		[1278] = "巡山人斯特恩",
		[2556] = "枯木猎头者",
		[12918] = "穆戈特酋长",
		[2560] = "高地长尾龙",
		[4097] = "加拉克狂怒者",
		[2564] = "石拳执行者",
		[2566] = "石拳蛮兵",
		[4109] = "雄性风巢飞龙",
		[14356] = "锯鳍狂鱼",
		[4117] = "风蛇",
		[2574] = "枯须掘地工",
		[4421] = "卡尔加·刺肋",
		[4129] = "眩晕",
		[2580] = "老山地秃鹰",
		[7206] = "古代的石头看守者",
		[745] = "刃鳞龙人队长",
		[2586] = "辛迪加路霸",
		[2588] = "辛迪加潜伏者",
		[8298] = "先知阿库巴尔",
		[2592] = "顽石流放者",
		[5184] = "塞拉摩哨兵",
		[3619] = "豹脾气",
		[2927] = "邪恶的枭兽",
		[1097] = "风险投资公司技工",
		[7246] = "沙怒暗影猎手",
		[9377] = "空气漩涡",
		[2923] = "癞皮银鬃狼",
		[1973] = "鸦爪守护者",
		[6239] = "塞克隆尼亚",
		[6243] = "格里哈斯特",
		[3637] = "变异守护者",
		[7274] = "沙怒刽子手",
		[3641] = "变异潜伏者",
		[10760] = "恐怖图腾地卜师",
		[7286] = "未知目标",
		[7290] = "暗炉狙击手",
		[3717] = "怒尾巫师",
		[2628] = "达拉然工人",
		[2630] = "地缚图腾 <唤地者哈穆加>",
		[7872] = "亡首教徒",
		[5822] = "斯考恩",
		[660] = "血顶巫医",
		[4249] = "杂毛嚎叫者",
		[2640] = "邪枝巫医",
		[2642] = "邪枝暗影法师",
		[2644] = "邪枝剥皮者",
		[7334] = "恐怖战斗野猪",
		[3671] = "安娜科德拉",
		[4273] = "守护者奥达努斯",
		[7346] = "碎骨百夫长",
		[4281] = "血色斥候",
		[4285] = "血色追随者",
		[7358] = "寒冰之王亚门纳尔",
		[4293] = "血色占卜师",
		[4297] = "血色咒术师",
		[4301] = "血色百夫长",
		[5806] = "树人盟友",
		[10720] = "加拉克刺客",
		[3924] = "蓟皮萨满祭司",
		[669] = "劈颅猎人",
		[3853] = "影牙夜行者",
		[2676] = "微型收割机 <风险投资公司机械师>",
		[10696] = "避难谷地防御者",
		[671] = "血顶猎头者",
		[4673] = "怨怒背叛者",
		[4341] = "尘泥鳄鱼",
		[7414] = "法力之泉图腾 II <台州湾大炮王>",
		[2554] = "枯木掷斧者",
		[3713] = "怒尾御浪者",
		[674] = "风险投资公司露天矿工",
		[4361] = "黑鳍泥浆鱼人",
		[675] = "风险投资公司工头",
		[2893] = "石窟断骨者",
		[676] = "风险投资公司勘探员",
		[1100] = "守夜人塞金",
		[677] = "风险投资公司修理工",
		[670] = "劈颅巫医",
		[2650] = "枯木狂热者",
		[4393] = "酸性沼泽软泥怪",
		[7789] = "沙怒智障者",
		[4296] = "血色老兵",
		[5428] = "大鹏",
		[12902] = "洛古斯·杰特",
		[4413] = "暗牙蜘蛛",
		[3745] = "污林探险者",
		[682] = "豹",
		[3749] = "污林巨熊怪",
		[2728] = "野生峭壁山狗",
		[2384] = "饥饿的山地狮",
		[684] = "深喉猎豹",
		[6487] = "奥法师杜安",
		[10928] = "魅魔",
		[667] = "劈颅战士",
		[686] = "鞭尾迅猛龙",
		[4457] = "黑腮强盗",
		[4461] = "黑腮战士",
		[4465] = "邪枝标枪手",
		[2748] = "阿扎达斯",
		[10992] = "被激怒的黑豹",
		[689] = "晶背蜥蜴",
		[4481] = "马塞尔·达比雷",
		[690] = "冷眼蜥蜴",
		[4789] = "腐根游荡者",
		[2760] = "烈焰流放者",
		[2762] = "雷霆流放者",
		[1062] = "可怕的奈兹里奥克",
		[4505] = "血帆桨手",
		[5755] = "剧毒飞蛇",
		[2850] = "断牙 <吴潇洒>",
		[694] = "血顶掷斧者",
		[3797] = "塞纳里奥保卫者",
		[4525] = "剃刀沼泽裂地者",
		[6575] = "血色预备兵",
		[696] = "劈颅掷斧者",
		[3875] = "鬼怪仆从",
		[697] = "血顶萨满祭司",
		[3809] = "灰谷熊",
		[698] = "血顶猛虎",
		[7768] = "枯木血虫",
		[699] = "血顶兽王",
		[7874] = "剃刀沼泽织棘者",
		[3819] = "野棘捕猎者",
		[3821] = "野棘潜伏者",
		[3823] = "幽爪奔跑者",
		[5600] = "戴兹帕可汗",
		[702] = "血顶食腐者",
		[7333] = "枯萎战斗野猪",
		[2268] = "希尔斯布莱德步兵",
		[3833] = "塞纳里奥辩护者",
		[3850] = "巫师阿克鲁比",
		[5756] = "变异剧毒风蛇",
		[5775] = "永生者沃尔丹",
		[10082] = "泽雷利斯",
		[3939] = "钢鬃狼",
		[5686] = "被俘虏的僵尸",
		[4659] = "玛洛迪掠夺者",
		[5648] = "沙怒暗影法师",
		[3851] = "影牙白头狼人",
		[2830] = "秃鹫",
		[3855] = "影牙魔魂狼人",
		[3857] = "影牙暴食者",
		[3859] = "影牙暴怒者",
		[3861] = "灰色座狼",
		[3863] = "暗牙恐狼",
		[5680] = "被俘虏的男人",
		[5763] = "噩梦软浆怪",
		[4665] = "火刃老兵",
		[7797] = "卢兹鲁",
		[3873] = "痛苦的文官",
		[4677] = "末日看守",
		[3877] = "哀嚎的卫兵",
		[731] = "幽影雷霆虎 <暗影狩猎者丿>",
		[10120] = "宝库护卫者",
		[4693] = "恐怖飞鸟",
		[4697] = "荒土鞭尾蝎",
		[3887] = "席瓦莱恩男爵",
		[4853] = "石窟地占师",
		[2831] = "巨型秃鹫",
		[3123] = "血爪锐齿龙",
		[7786] = "祖穆拉恩骷髅",
		[4627] = "阿鲁高的虚空行者",
		[5646] = "沙怒掷斧者",
		[4729] = "笨重的砂腭蜥蜴",
		[3903] = "灼热图腾 III <台州湾大炮王>",
		[3846] = "塔尔伦",
		[1563] = "血帆流氓",
		[741] = "睡梦雏龙",
		[4663] = "火刃预言师",
		[3913] = "石爪图腾 IV <台州湾大炮王>",
		[5780] = "克隆软浆怪",
		[3917] = "污浊的水元素",
		[3991] = "风险投资公司砍树工",
		[3921] = "蓟皮巨熊怪",
		[3122] = "血爪鞭尾龙",
		[7846] = "吞噬者特雷姆斯",
		[3927] = "狼王南杜斯",
		[1551] = "铁腭蜥蜴",
		[728] = "巴尔瑟拉",
		[7011] = "土灵碎岩者",
		[729] = "辛达尔",
		[4025] = "血怒伏击者",
		[5828] = "狮王修玛",
		[4809] = "暮光侍僧",
		[5836] = "技师维尔雷格",
		[6016] = "防护元素图腾 <亡首圣贤>",
		[2924] = "银鬃狼",
		[4825] = "阿库麦尔钳嘴龟",
		[2928] = "远古枭兽",
		[5856] = "晶网蜘蛛",
		[2932] = "马格雷甘·深影",
		[92] = "石元素",
		[4845] = "暗炉恶棍",
		[4849] = "暗炉考古学家",
		[736] = "黑豹",
		[4857] = "石头看守者",
		[4861] = "利齿蝙蝠",
		[4124] = "千针石林山狮",
		[4633] = "科卡尔斥候",
		[10761] = "恐怖图腾抢夺者",
		[3975] = "赫洛德",
		[3977] = "大检察官怀特迈恩",
		[740] = "翠绿幼龙",
		[2958] = "未知目标",
		[3983] = "审讯员韦沙斯",
		[3985] = "韦沙斯老爷爷",
		[3987] = "达尔·血爪",
		[5928] = "悲哀之翼",
		[5932] = "工头维普弗恩",
		[3993] = "风险投资公司机械师",
		[744] = "绿色刃鳞龙人",
		[1488] = "赞吉尔僵尸",
		[1489] = "赞吉尔猎人",
		[1490] = "赞吉尔巫医",
		[1491] = "赞吉尔纳迦",
		[4005] = "深苔爬行者",
		[4007] = "深苔毒蜘蛛",
		[4009] = "狂怒的峭壁雷鸣蜥蜴",
		[4011] = "幼年巨翼双足飞龙",
		[4013] = "巨翼捕猎者",
		[2992] = "治疗结界 V <亡首先知>",
		[5647] = "沙怒猎头者",
		[750] = "沼泽喷墨鱼人",
		[4021] = "腐蚀性的腐蚀兽",
		[4023] = "血怒游荡者",
		[4977] = "软壳黑泥龙虾人",
		[4027] = "血怒雷巫",
		[772] = "荆棘谷雌虎",
		[4031] = "奇美拉雏兽",
		[7039] = "战争掠夺者",
		[6020] = "滑壳龙虾人",
		[4037] = "燃烧的掠夺者",
		[755] = "泥泞失落者",
		[4041] = "炭色石化蜥蜴",
		[756] = "劈颅黑豹",
		[1543] = "邪鳍污水鱼人",
		[757] = "失落者渔夫",
		[4093] = "加拉克争斗者",
		[4051] = "塞纳里奥植物学家",
		[4053] = "塞纳留斯的女儿",
		[759] = "失落者猎人",
		[4057] = "塞纳留斯的儿子",
		[760] = "失落定居者",
		[2534] = "流亡者赞吉尔",
		[5053] = "变异鳄鱼",
		[3669] = "考布莱恩",
		[4067] = "夜行虎",
		[2546] = "舰队指挥官菲尔拉伦",
		[8138] = "苏利萨斯幼崽",
		[4073] = "XT:4",
		[764] = "沼泽漫步者",
		[4288] = "血色驯兽员",
		[781] = "劈颅猎头者",
		[10639] = "洛吉什",
		[766] = "纠缠恐兽",
		[5097] = "错觉狼影 <暗牙恐狼>",
		[767] = "沼泽虎",
		[6240] = "挑衅者",
		[6132] = "剃刀沼泽仆从",
		[1536] = "血色传教士",
		[1537] = "血色狂热者",
		[7275] = "暗影祭司塞瑟斯",
		[2053] = "哈迦德难民",
		[7175] = "石窟伏击者",
		[4110] = "雌性风巢飞龙",
		[1526] = "破碎的尸体",
		[4118] = "毒性风蛇",
		[6168] = "鲁古格",
		[4126] = "峭壁捕猎者",
		[1564] = "血帆术士",
		[2069] = "豹",
		[1548] = "被诅咒的黑暗犬",
		[1549] = "饥饿的黑暗犬",
		[1550] = "钢尾蜥蜴",
		[4150] = "盐石凝视者",
		[4154] = "盐湖食腐鹫",
		[4158] = "盐湖秃鹫",
		[1554] = "吸血夜行蝙蝠",
		[2105] = "巡山人多克金",
		[3110] = "巨齿鳄鱼",
		[1557] = "老迈的迷雾谷猩猩",
		[7247] = "沙怒噬魂者",
		[780] = "劈颅秘法师",
		[1565] = "血帆水手",
		[1561] = "血帆袭击者",
		[1562] = "血帆法师",
		[6244] = "先知塔卡尔",
		[7271] = "巫医祖穆拉恩",
		[783] = "劈颅狂战士",
		[2530] = "耶尼库",
		[784] = "劈颅兽王",
		[5800] = "马库斯·拜尔",
		[7291] = "加加恩·火锤",
		[1893] = "月怒哨兵",
		[3633] = "变异屠戮者",
		[4829] = "阿库麦尔",
		[4541] = "阿迦玛甘之血",
		[4479] = "法迪尔·达比雷",
		[2406] = "二丫",
		[7343] = "碎骨骷髅",
		[9523] = "科卡尔风暴先知",
		[7327] = "枯萎战士",
		[4278] = "指挥官斯普林瓦尔",
		[7335] = "亡首地卜师",
		[7355] = "图特卡什",
		[4274] = "吞噬者芬鲁斯",
		[7347] = "嚼骨食尸鬼",
		[4282] = "血色魔法师",
		[4286] = "血色士兵",
		[4290] = "血色卫兵",
		[4294] = "血色魔术师",
		[4298] = "血色防御者",
		[4302] = "血色勇士",
		[4306] = "血色拷问者",
		[4459] = "黑腮智者",
		[6494] = "塔赞",
		[2739] = "暗炉隧道工",
		[2163] = "熊",
		[8886] = "变异巨蟒",
		[6489] = "铁脊死灵",
		[11577] = "旋风雷暴行者",
		[3754] = "萨维亚叛徒",
		[4342] = "尘泥锐爪鳄鱼",
		[3198] = "火刃学徒",
		[3752] = "萨维亚潜行者",
		[3750] = "污林图腾师",
		[3204] = "加祖兹",
		[4362] = "黑鳍滩行鱼人",
		[730] = "泰希斯",
		[3746] = "污林卫兵",
		[2066] = "议员海加斯",
		[12856] = "灰谷先驱者",
		[4382] = "枯藤爬行者",
		[4386] = "枯藤断木者",
		[3226] = "堕落蝎",
		[1870] = "鸦爪之手",
		[3232] = "刺背干涉者",
		[5425] = "饥饿的疱爪土狼",
		[4422] = "暴怒的阿迦赛罗斯",
		[4458] = "黑腮猎人",
		[4414] = "暗牙毒蜘蛛",
		[3284] = "风险投资公司苦工",
		[10882] = "阿利卡拉",
		[3238] = "雷鳞蜥蜴",
		[3240] = "雷角蜥蜴",
		[205] = "夜行黑暗狼人",
		[4438] = "剃刀沼泽刺鬃守卫",
		[4442] = "剃刀沼泽防御者",
		[4514] = "暴怒的阿迦玛",
		[3250] = "异种爬行者",
		[3252] = "异种群居蝎",
		[3254] = "赤鳞鞭尾龙",
		[3256] = "赤鳞镰爪龙",
		[3258] = "刺背猎手",
		[3260] = "刺背寻水者",
		[2261] = "辛迪加卫士",
		[2241] = "辛迪加窃贼",
		[4534] = "被驯服的土狼 <剃刀沼泽兽王>",
		[2271] = "达拉然持盾守卫",
		[1860] = "萨克雷斯",
		[3272] = "科卡尔牧民",
		[2251] = "巨型雪人",
		[2253] = "破碎岭蛮兵",
		[2255] = "破碎岭法师",
		[4510] = "赫尔拉斯·静水",
		[3282] = "风险投资公司雇佣兵",
		[4518] = "亡首圣贤",
		[4522] = "剃刀沼泽织尘者",
		[2265] = "未知目标",
		[2267] = "希尔斯布莱德农民",
		[2269] = "希尔斯布莱德矿工",
		[4538] = "沼泽蝙蝠",
		[4542] = "大检察官法尔班克斯",
		[1547] = "衰老的黑暗犬",
		[2691] = "高原前锋",
		[1535] = "血色战士",
		[1653] = "血帆大法师",
		[587] = "血顶战士",
		[10647] = "拉兹王子",
		[4506] = "血帆水兵",
		[7404] = "加拉克烈焰守卫",
		[10759] = "恐怖图腾践踏者",
		[4435] = "剃刀沼泽战士",
		[5617] = "废土暗法师",
		[416] = "拉兹洛普 <Hellothanku>",
		[1662] = "派瑞恩队长",
		[2319] = "辛迪加巫师",
		[4279] = "盲眼守卫奥杜",
		[844] = "安东尼奥·皮雷利",
		[4303] = "血色修士",
		[3374] = "巴尔丹挖掘者",
		[1689] = "野猪",
		[6668] = "塞瑞克·黑炉公爵",
		[5649] = "沙怒饮血者",
		[3382] = "南海炮兵",
		[4634] = "科卡尔虐待者",
		[7356] = "腐烂的普雷莫尔",
		[7352] = "冰冻之魂",
		[2653] = "枯木虐待者",
		[3674] = "斯卡姆",
		[4654] = "玛洛迪斥候",
		[5681] = "被俘虏的女人",
		[2333] = "仆从瓦里克",
		[4666] = "火刃魔仆",
		[4670] = "怨怒潜行者",
		[4674] = "怨怒巡影者",
		[4678] = "噬法魔犬",
		[2649] = "枯木割颅者",
		[2345] = "丹加洛克火枪手",
		[4726] = "暴怒的雷霆蜥蜴",
		[4694] = "恐怖撕裂者",
		[2351] = "灰熊",
		[3376] = "巴尔丹士兵",
		[3378] = "巴尔丹军官",
		[4263] = "深苔幼蛛",
		[2359] = "元素奴仆",
		[7787] = "沙怒奴隶",
		[3386] = "塞拉摩医师",
		[7795] = "水占师维蕾萨",
		[3394] = "巴拉克·科多班恩",
		[3392] = "勘察员卡兹戈姆",
		[5761] = "变异蹒跚者",
		[3396] = "赫兹鲁尔·血印",
		[854] = "幼年丛林捕猎者",
		[7320] = "石窟虐待者",
		[8477] = "骷髅仆从",
		[5781] = "异种爬行者的卵 <异种爬行者>",
		[11562] = "枯钳龙虾人",
		[2385] = "野生山地狮",
		[2387] = "希尔斯布莱德议员",
		[5797] = "艾恩·流水",
		[3414] = "塔文布莱德将军",
		[855] = "幼年荆棘谷迅猛龙",
		[1713] = "豹",
		[856] = "幼年鞭尾迅猛龙",
		[4810] = "暮光劫掠者",
		[4798] = "腐根巡影者",
		[4802] = "黑暗深渊海潮祭司",
		[858] = "沼泽纺丝蛛",
		[2407] = "巨型山地狮",
		[4814] = "暮光元素法师",
		[3434] = "纳克",
		[3436] = "卡兹",
		[5849] = "矿工弗雷姆",
		[5645] = "沙怒剥皮者",
		[2373] = "泥嘴萨满祭司",
		[2427] = "狱卒埃斯顿",
		[4842] = "唤地者哈穆加",
		[4846] = "暗炉掘地工",
		[4850] = "石窟潜伏者",
		[4854] = "格瑞姆洛克",
		[3454] = "炮兵斯密瑟",
		[6908] = "奥拉夫",
		[13816] = "勘查员塔雷·石镐",
		[4818] = "盲光鱼人",
		[9524] = "科卡尔入侵者",
		[4637] = "科卡尔摧毁者",
		[5921] = "大地之力图腾 II <污林萨满祭司>",
		[3476] = "依沙瓦克",
		[5913] = "战栗图腾 <格瑞姆洛克>",
		[2449] = "平民维尔克斯",
		[2451] = "农夫卡拉巴",
		[12865] = "玛克林大使",
		[5929] = "熔岩图腾 <枯木巫医>",
		[871] = "盐鳞战士",
		[7276] = "祖尔法拉克阵亡英雄",
		[7272] = "殉教者塞卡",
		[7268] = "沙怒守护者",
		[873] = "盐鳞智者",
		[12921] = "被激怒的污林熊怪",
		[2469] = "巡山人拉伦",
		[921] = "风险投资公司伐木工",
		[875] = "盐鳞首领",
		[8015] = "灰谷哨兵",
		[3458] = "钢鬃先知",
		[8877] = "沙怒狂热者",
		[877] = "盐鳞强盗",
		[3868] = "觅血者",
		[7012] = "土灵雕刻者",
		[5997] = "守望堡技师",
		[879] = "盐鳞猎人",
		[4978] = "阿库麦尔的仆从",
		[7344] = "碎骨战士",
		[4958] = "不散的怨灵 <头哥>",
		[1766] = "杂斑座狼",
		[6017] = "熔岩喷射图腾 <亡首先知>",
		[6021] = "野猪之魂 <阿格姆>",
		[2503] = "希尔斯布莱德工头",
		[1765] = "座狼",
		[442] = "狼蛛",
		[1778] = "凶猛的灰斑熊",
		[5058] = "警戒座狼",
		[1769] = "月怒白头狼人",
		[8095] = "苏利萨斯沙行者",
		[7076] = "土灵守护者",
		[905] = "利齿狂鱼",
		[3566] = "平原徘徊者",
		[4151] = "盐石水晶蜥蜴",
		[888] = "守夜人道茨",
		[2587] = "辛迪加巡路者",
		[2529] = "阿鲁高之子",
		[8127] = "安图苏尔",
		[1797] = "巨型灰斑熊",
		[2535] = "“畸形足”玛雷·维尔金斯",
		[3560] = "治疗结界 <恐怖图腾践踏者>",
		[1782] = "月怒魔魂狼人",
		[13217] = "塔萨迪斯·雪光",
		[2543] = "大法师安斯雷姆·鲁因维沃尔",
		[2545] = "帅小伙子邓肯",
		[2547] = "艾隆帕",
		[1787] = "骷髅刽子手",
		[1788] = "骷髅军官",
		[2553] = "枯木暗影法师",
		[2555] = "枯木巫医",
		[8179] = "强效治疗结界 <沙怒巫医>",
		[2559] = "高地阔步龙",
		[2561] = "高地猎兽龙",
		[4099] = "加拉克掠夺者",
		[2565] = "巨型平原狼蛛",
		[4107] = "风巢双足飞龙",
		[4111] = "砂齿狗头人",
		[2573] = "枯须勘探员",
		[4119] = "老风蛇",
		[2567] = "石拳法师",
		[4127] = "乱齿土狼",
		[2579] = "山地秃鹰",
		[2581] = "达比雷民兵",
		[4139] = "恐蝎",
		[1805] = "血肉傀儡",
		[4147] = "盐石蜥蜴",
		[2589] = "辛迪加雇佣兵",
		[1795] = "灼热的食尸鬼",
		[7228] = "艾隆纳亚",
		[2563] = "平原狼蛛",
		[2557] = "枯木暗影猎手",
		[1789] = "骷髅侍僧",
		[2549] = "加尔·盐蹄",
		[2537] = "拇指苏克",
		[1794] = "没有灵魂的食尸鬼",
		[3630] = "变异曲蛇",
		[3632] = "变异爬行者",
		[3634] = "变异捕猎者",
		[3636] = "变异破坏者",
		[3638] = "吞噬软浆怪",
		[3640] = "大型软浆怪",
		[1822] = "毒雾潜伏者",
		[4287] = "血色豪侠",
		[2623] = "上古之魂 <达拉然法师>",
		[3424] = "雷鹰破云者",
		[5687] = "被俘虏的憎恶",
		[3456] = "钢鬃探路者",
		[3654] = "吞噬者穆坦努斯",
		[2651] = "枯木剥皮者",
		[2635] = "老海鳄",
		[2403] = "农夫盖兹",
		[11563] = "枯钳巨螯龙虾人",
		[2641] = "邪枝猎头者",
		[7328] = "枯萎掠夺者",
		[7332] = "枯萎矛鬃野猪人",
		[3670] = "皮萨斯",
		[7340] = "骷髅暗影法师 <骷髅召唤者>",
		[4275] = "大法师阿鲁高",
		[7348] = "噬棘食尸鬼",
		[4283] = "血色哨兵",
		[2657] = "训练有素的锋喙狮鹫",
		[4291] = "血色教士",
		[4295] = "血色仆从",
		[4299] = "血色牧师",
		[923] = "黑色破坏者幼崽",
		[2667] = "懒惰结界效果 <莫什奥格巫医>",
		[5685] = "被俘虏的食尸鬼",
		[5677] = "魅魔",
		[2349] = "巨型食苔蛛",
		[2675] = "自爆绵羊 <技师维尔雷格>",
		[7396] = "土灵破石者",
		[2260] = "辛迪加潜行者",
		[232] = "农夫雷恩",
		[4805] = "黑暗深渊海巫",
		[4343] = "尘泥钳嘴鳄鱼",
		[3197] = "火刃狂热者",
		[4351] = "血沼迅猛龙",
		[4355] = "血沼镰爪龙",
		[10756] = "滚烫的水元素",
		[7432] = "联盟欢迎你",
		[4530] = "剃刀沼泽训练师",
		[4526] = "风嚎者",
		[2701] = "火烟食人魔",
		[5402] = "赫鲁萨可汗",
		[8996] = "虚空行者",
		[2249] = "凶恶的雪人",
		[1867] = "达拉然学徒",
		[8876] = "沙怒侍僧",
		[5422] = "沙漠猎食蝎",
		[2715] = "火烟蛮兵",
		[2717] = "火烟虐待者",
		[4411] = "未知目标",
		[4415] = "巨型暗牙蜘蛛",
		[12922] = "小鬼爪牙 <冷心唤魔者>",
		[3748] = "污林萨满祭司",
		[4427] = "结界卫士",
		[2729] = "老峭壁山狗",
		[2731] = "山脊巡行者",
		[2727] = "峭壁山狗",
		[2735] = "次级石元素",
		[6493] = "幻象之影 <鬼魅幻影>",
		[6497] = "阿斯托·哈德恩",
		[2175] = "豹",
		[2743] = "暗炉战士",
		[7351] = "墓穴劫掠者",
		[3770] = "冷心捕猎者",
		[4517] = "亡首祭司",
		[1888] = "达拉然卫士",
		[1889] = "达拉然巫师",
		[1084] = "小盐齿鳄鱼",
		[2732] = "豹",
		[1892] = "月怒守卫",
		[2761] = "水浪流放者",
		[5835] = "工头葛瑞尔斯",
		[3925] = "蓟皮复仇者",
		[4095] = "加拉克虐待者",
		[4511] = "阿迦玛",
		[4515] = "亡首侍僧",
		[4519] = "亡首先知",
		[4523] = "剃刀沼泽震地者",
		[782] = "劈颅斥候",
		[4531] = "剃刀沼泽驯兽师",
		[4535] = "被驯服的斗猪",
		[4539] = "巨型沼泽蝙蝠",
		[4543] = "血法师萨尔诺斯",
		[3810] = "老灰谷熊",
		[1907] = "纳迦探险者",
		[2063] = "议员维尔海姆",
		[2562] = "石拳食人魔",
		[14430] = "豹",
		[3820] = "野棘毒蜘蛛",
		[1912] = "达拉然保卫者",
		[3824] = "幽爪嗥叫者",
		[1914] = "达拉然法师",
		[2578] = "食腐鸟",
		[2582] = "达比雷劳工",
		[7267] = "乌克兹·沙顶",
		[5618] = "废土强盗",
		[7668] = "拉瑟莱克的仆从",
		[2590] = "辛迪咒术师",
		[3840] = "尖牙德鲁伊",
		[7226] = "未知目标 <古代的石头看守者>",
		[3844] = "治疗结界 IV <钢鬃先知>",
		[1924] = "月怒血啸者",
		[4623] = "野猪人勇士",
		[5650] = "沙怒巫医",
		[2829] = "饥饿的秃鹫",
		[3854] = "影牙狼人卫兵",
		[4202] = "格雷苏",
		[1544] = "邪鳍先知",
		[2658] = "锋喙狮鹫",
		[3862] = "被奴役的座狼",
		[4655] = "玛洛迪争斗者",
		[3866] = "邪蝠",
		[1935] = "提瑞斯法雇农",
		[4667] = "火刃暗影法师",
		[4671] = "怨怒欺诈者",
		[4675] = "怨怒唤魔者",
		[2272] = "达拉然法师",
		[539] = "小型结网毒蜘蛛",
		[6733] = "石窟猛击者",
		[2859] = "盖尔",
		[4260] = "风险投资公司伐木机",
		[3886] = "屠夫拉佐克劳",
		[3283] = "风险投资公司执行者",
		[3673] = "瑟芬迪斯",
		[2652] = "枯木毒血巨魔",
		[7342] = "骷髅召唤者",
		[7788] = "沙怒苦工",
		[4723] = "工头考兹尔",
		[4727] = "老迈的雷霆蜥蜴",
		[3902] = "灼热图腾 II <钢鬃先知>",
		[6907] = "埃瑞克",
		[5762] = "弱毒飞蛇",
		[1096] = "风险投资公司地质学家",
		[5996] = "守望堡矿工",
		[1957] = "邪鳍巡滩者",
		[3914] = "雷希戈尔",
		[12579] = "血怒撕裂者",
		[7091] = "暗炉伏击者",
		[5863] = "土地祭司古科罗克",
		[2686] = "枯木巢穴守卫",
		[7844] = "火焰新星图腾 IV <安图苏尔>",
		[3926] = "蓟皮探路者",
		[3928] = "腐烂的泥浆怪",
		[2907] = "火烟秘法师",
		[2909] = "铁趾格雷兹",
		[4795] = "自然之力 <塞纳里奥辩护者>",
		[4799] = "腐根唤魔者",
		[4803] = "黑暗深渊智者",
		[4807] = "黑暗深渊仆从",
		[4811] = "暮光水占师",
		[4815] = "巨钳黑泥龙虾人",
		[4819] = "盲光泥居者",
		[4823] = "刺毛甲壳蟹",
		[4827] = "深池蛇颈龙",
		[4831] = "萨利维丝",
		[1101] = "守夜人萨耶尔",
		[588] = "血顶斥候",
		[4140] = "恐蝎劫掠者",
		[4847] = "暗炉发掘者",
		[4851] = "石窟嚼石者",
		[4855] = "石窟争斗者",
		[2736] = "巨型石元素",
		[2945] = "莫达洛克",
		[683] = "猎豹幼崽",
		[10757] = "沸腾的水元素",
		[3974] = "驯犬者洛克希",
		[3976] = "血色十字军指挥官莫格莱尼",
		[685] = "荆棘谷迅猛龙",
		[4887] = "加摩拉",
		[3247] = "雷鹰雏鸟",
		[3984] = "南希·韦沙斯",
		[499] = "守夜人派格",
		[3988] = "风险投资公司操作员",
		[5930] = "瑞雯",
		[3992] = "风险投资公司工程师",
		[345] = "高小凡",
		[11876] = "未知目标",
		[2240] = "辛迪加劫匪",
		[7996] = "守护者奇尔加",
		[2244] = "辛迪加暗影法师",
		[2250] = "山岭雪人",
		[4006] = "深苔结网蛛",
		[4008] = "峭壁雷鸣蜥蜴",
		[3285] = "风险投资公司雇工",
		[4012] = "巨翼双足飞龙",
		[570] = "食脑者",
		[1142] = "莫什奥格蛮兵",
		[8585] = "未知目标",
		[4020] = "腐蚀兽",
		[4022] = "血怒鹰身人",
		[4024] = "血怒杀戮者",
		[4026] = "血怒唤风者",
		[4028] = "烧焦的树人",
		[4030] = "狂怒的树人",
		[4032] = "奇美拉幼崽",
		[4034] = "狂怒的石灵",
		[4036] = "游荡的焰灵",
		[4038] = "燃烧的破坏者",
		[3743] = "污林战士",
		[4042] = "焦黑石化蜥蜴",
		[4044] = "黑色石化蜥蜴",
		[2354] = "邪恶的灰熊",
		[1184] = "峭壁潜伏者",
		[2892] = "石窟先知",
		[7077] = "土灵筑厅师",
		[4054] = "欢笑的姐妹",
		[1974] = "鸦爪苦工",
		[6066] = "陷地 <剃刀沼泽图腾师>",
		[3435] = "未知目标",
		[8120] = "苏利萨斯憎恶",
		[5055] = "变异鞭笞者",
		[2960] = "草原狼前锋",
		[3767] = "冷心欺诈者",
		[4070] = "风险投资公司建筑师",
		[4035] = "暴烈的石灵",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		"变异屠戮者", -- [1]
		3, -- [2]
		[0] = 1,
		["叉状闪电"] = "萨利维丝",
		["法术反制"] = 8,
		["重伤"] = 1,
		["护甲"] = 7,
		["死亡之愿"] = 1,
		["召唤魅魔"] = 9,
		["愈合"] = 11,
		["伏击"] = 4,
		["精神"] = 1,
		["制造魔法红宝石"] = "道若水",
		["急救"] = 1,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		["强效敏捷"] = 11,
		["复苏之风"] = 5,
		["龙血酒"] = 8,
		["疲劳诅咒"] = 9,
		["荆棘术"] = 1,
		["喝水"] = 8,
		["渐隐术"] = 5,
		["冷酷"] = 4,
		["速效毒药 III"] = 4,
		["次级力量"] = 4,
		["嘲讽"] = 1,
		["灼热武器"] = 1,
		["护甲 +16"] = 8,
		["快速治疗"] = 5,
		["雷霆一击"] = 1,
		["召唤被奴役的座狼"] = "狼王南杜斯",
		["嗜血"] = 1,
		["闷棍"] = 4,
		["灵猴守护"] = 3,
		["冰封攻击"] = 7,
		["安图苏尔的治疗波"] = "安图苏尔",
		["净化术"] = 7,
		["冰链术"] = "亡首专家",
		["闪电吐息"] = "夫子 <老童>",
		["击溃"] = "暴怒的阿迦赛罗斯",
		["巨熊形态"] = 11,
		["烈焰风暴"] = 8,
		["切割"] = 4,
		["遗弃技能：暗影"] = 1,
		["心灵视界"] = 5,
		["音素爆破"] = "巨型沼泽蝙蝠",
		["献祭陷阱"] = 3,
		["治疗之触"] = "尖牙德鲁伊",
		["黑暗祭品"] = "阿鲁高的虚空行者",
		["挥砍"] = "变异鞭笞者",
		["自毁"] = "石头看守者",
		["次级智力"] = 9,
		["低吼"] = "野猪 <东乡一二三>",
		["猛虎之怒"] = 11,
		["制造魔法玛瑙"] = 8,
		["再生"] = 8,
		["挑战怒吼"] = 1,
		["黑曜石破碎"] = "黑曜石哨兵",
		["疾病射击"] = "枯萎矛鬃野猪人",
		["霜甲术"] = 8,
		["斩杀"] = 1,
		["压制"] = 1,
		["冰冻"] = 8,
		["毒性钉刺"] = "毒鞭蝎",
		["石肤术"] = 7,
		["寒冰护体"] = "道若水",
		["虫群"] = 11,
		["幽魂之狼"] = 7,
		["打击"] = "土灵碎岩者",
		["闪避"] = 4,
		["巨化术"] = "暮光寻知者",
		["恢复法力"] = 8,
		["石肤图腾"] = 7,
		["无情打击效果"] = 4,
		["包围之风"] = "剃刀沼泽织尘者",
		["震荡射击"] = 3,
		["防护火焰结界"] = 8,
		["寒冰屏障"] = 8,
		["脚踢"] = 4,
		["热疫"] = "耐克鲁姆",
		["毒蛇钉刺"] = 3,
		["折磨"] = "哈斯哈格 <Hellothanku>",
		["十字军打击"] = "血色豪侠",
		["暗影箭"] = 9,
		["强化震荡射击"] = 3,
		["撒网"] = "图特卡什",
		["复活宠物"] = 3,
		["鬼魂装束"] = 9,
		["血之狂热"] = 1,
		["遗弃技能：神圣"] = 11,
		["制造块茎"] = "地鼠 <胸大臀翘>",
		["陷地图腾"] = "剃刀沼泽图腾师",
		["火舌图腾"] = 7,
		["腐烂恶臭"] = "腐烂的普雷莫尔",
		["熊形态"] = 11,
		["丝绸卷"] = 5,
		["强效智力"] = 11,
		["安图苏尔的爪牙"] = "安图苏尔",
		["急奔"] = 11,
		["放逐术"] = 9,
		["精神鞭笞"] = 5,
		["根基图腾"] = 7,
		["破甲攻击"] = 1,
		["自我治疗"] = 11,
		["受难"] = "哈斯哈格 <Hellothanku>",
		["变形术"] = 8,
		["火焰箭"] = "祖布洛普",
		["图特卡什的诅咒"] = "图特卡什",
		["Warder Despawn"] = "安图苏尔",
		["神圣之灵"] = 5,
		["圣光击"] = "血色追随者",
		["闪电箭"] = "尖牙德鲁伊",
		["野性回复"] = "变异蹒跚者",
		["猛击"] = 1,
		["冰霜震击"] = "暮光元素法师",
		["雄鹰守护"] = 3,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["毒药"] = "无毒飞蛇",
		["法力护盾"] = 8,
		["枯萎之触"] = "枯萎野猪人守卫",
		["迅捷治愈"] = 11,
		["裂筋"] = "深池蛇颈龙",
		["旋风倾泻"] = "剃刀沼泽刺鬃守卫",
		["实心炸弹"] = 11,
		["力量"] = 1,
		["敏捷"] = 1,
		["暴跳如雷"] = "暴怒的阿迦赛罗斯",
		["生命虹吸"] = 9,
		["召唤仪式"] = 9,
		["阿鲁高的礼物"] = "阿鲁高之子",
		["进食"] = 8,
		["召唤野猪之魂"] = "阿格姆",
		["法力燃烧"] = 5,
		["战斗怒吼"] = 1,
		["小精灵装束"] = 1,
		["灼热之痛"] = 9,
		["精神分流"] = 5,
		["冲锋击昏"] = 1,
		["猎豹守护"] = 3,
		["致命毒药"] = "一一小可爱",
		["大地震颤"] = "剃刀沼泽震地者",
		["盾牌猛击"] = "奥拉夫",
		["毒云术"] = "阿库麦尔",
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["摇摆意志"] = "灰色座狼",
		["心灵震颤"] = "剃刀沼泽裂地者",
		["恶魔学识大师"] = 9,
		["乱舞"] = 7,
		["吸血毒药"] = "盲光泥居者",
		["疾病之云"] = "暴食者",
		["神圣新星"] = 5,
		["多重射击"] = 3,
		["休眠"] = 11,
		["遗弃技能：斧"] = 1,
		["召唤冰霜亡魂"] = "寒冰之王亚门纳尔",
		["遗弃技能"] = "痛苦的文官",
		["猫鼬撕咬"] = 3,
		["制造魔法黄水晶"] = 8,
		["召唤暗影法师"] = "骷髅召唤者",
		["复活节糖果"] = 11,
		["制造灵魂石"] = 9,
		["大地之力图腾"] = 7,
		["恐惧嚎叫"] = 9,
		["野兽之眼"] = 3,
		["风之优雅图腾"] = 7,
		["地缚图腾"] = 7,
		["剧痛鞭笞"] = "尼姆艾斯 <火星星>",
		["疾跑"] = "要想富得种树",
		["根基图腾效果"] = 7,
		["缓落术"] = 8,
		["雷霆震裂"] = "吞噬者穆坦努斯",
		["治疗石"] = 1,
		["高爆炸弹"] = 11,
		["风暴打击"] = 7,
		["冰霜陷阱"] = 3,
		["召唤警戒座狼"] = "影牙狼人卫兵",
		["心灵尖啸"] = 5,
		["奇特的朗姆酒"] = 8,
		["传送：月光林地"] = 11,
		["召唤黑曜石碎片"] = "黑曜石哨兵",
		["暴风雪"] = 8,
		["冰甲术"] = 8,
		["胸闷"] = 1,
		["战斗姿态"] = 1,
		["灵魂虹吸"] = 9,
		["召唤地狱战马"] = 9,
		["狂野怒火"] = 3,
		["强化格挡"] = "剃刀沼泽防御者",
		["火舌武器"] = 7,
		["惩戒痛击"] = 1,
		["灵魂撕咬"] = "沙怒噬魂者",
		["中皮"] = 11,
		["节能施法"] = 8,
		["致死打击"] = 1,
		["催眠术"] = "安娜科德拉",
		["海盗装束"] = 1,
		["忍者装束"] = 9,
		["元素浩劫"] = 7,
		["召唤宠物"] = 3,
		["灵魂石复活"] = 9,
		["拦截昏迷"] = 1,
		["回春药水"] = 8,
		["凶猛撕咬"] = 11,
		["土灵卫士被摧毁"] = "土灵筑厅师",
		["元素诅咒"] = "血色预言师",
		["嚎叫之怒"] = "盲眼守卫奥杜",
		["次级护甲"] = 8,
		["次级治疗药水"] = 8,
		["丝质绷带"] = "喊法爷给吃喝",
		["畏缩"] = "狼 <六九五>",
		["饮水"] = 11,
		["治疗之泉"] = "治疗之泉图腾 <北凉一枝花>",
		["水下呼吸"] = 9,
		["耐力"] = 9,
		["防护元素图腾"] = "亡首圣贤",
		["献祭"] = 9,
		["血液分流"] = "影牙暴食者",
		["盘蛇净化"] = "纳拉雷克斯的信徒",
		["奥术射击"] = 3,
		["造食术"] = 8,
		["Fire"] = "环境伤害 (火烧)",
		["乱射"] = 3,
		["变异鱼大餐"] = 11,
		["攻击"] = "灼热图腾 II <北凉一枝花>",
		["遗弃技能：火焰"] = 1,
		["战争践踏"] = 11,
		["妖术"] = "沙怒暗影猎手",
		["石化武器"] = 7,
		["穿刺射击"] = "暗炉狙击手",
		["腐化传染"] = 1,
		["逃脱"] = 3,
		["旋风斩效果"] = "赫洛德",
		["摔绊"] = 3,
		["沉默"] = "奥法师杜安",
		["爆炸射击"] = "血色驯兽员",
		["治疗波"] = 7,
		["!Melee"] = 1,
		["大地之力"] = 7,
		["狂暴回复"] = 11,
		["初级法力药水"] = 8,
		["遗弃技能：双手剑"] = 11,
		["恶魔牺牲"] = 9,
		["腐蚀毒药"] = 1,
		["追踪隐藏生物"] = 3,
		["自爆绵羊"] = "自爆绵羊 <血色布丁>",
		["飓风"] = 11,
		["冰霜陷阱光环"] = 3,
		["噬灵瘟疫"] = 5,
		["荆棘光环"] = "变异守护者",
		["寒冰箭"] = 8,
		["强效治疗术"] = 5,
		["治疗药水"] = 1,
		["自动射击"] = 3,
		["制裁之锤"] = "指挥官斯普林瓦尔",
		["新近包扎"] = 1,
		["狂暴"] = 8,
		["召唤地行者"] = "唤地者哈穆加",
		["血性狂暴"] = 1,
		["急速冲锋"] = "被驯服的斗猪",
		["重击"] = 11,
		["恐吓"] = "变异尖牙风蛇",
		["召唤错觉狼影"] = "暗牙恐狼",
		["投网"] = "格里哈斯特",
		["随机装束"] = 11,
		["治疗链"] = "阿格姆",
		["牺牲"] = 9,
		["恶魔耐力"] = 9,
		["铁皮手雷"] = 11,
		["法力之泉"] = "法力之泉图腾 <北凉一枝花>",
		["笨拙术"] = "影牙魔魂狼人",
		["搜索"] = 4,
		["暗灰狼"] = 1,
		["召唤水中护卫"] = "暮光水占师",
		["投掷"] = 4,
		["黑暗回复"] = "影牙狼人卫兵",
		["射击"] = 8,
		["霜寒刺骨"] = 8,
		["连发寒冰箭"] = "阿库麦尔的仆从",
		["冰霜新星"] = 8,
		["深冬之寒"] = 8,
		["诅咒之血"] = "腐烂的阿迦玛",
		["次级治疗石"] = 1,
		["进食充分"] = 4,
		["神圣打击"] = "血色医师",
		["灼热图腾"] = 7,
		["突进"] = "野猪 <孤殇忧逝如今>",
		["潜行"] = 11,
		["召唤土狼"] = "剃刀沼泽兽王",
		["刺耳怒吼"] = 1,
		["挫志怒吼"] = 1,
		["痛击"] = "变异破坏者",
		["毒性射击"] = "剃刀沼泽兽王",
		["狂暴怒气"] = "阿库麦尔",
		["传送：幽暗城"] = 8,
		["解除次级诅咒"] = 8,
		["防护冰霜结界"] = "黑暗深渊海巫",
		["石爪图腾"] = 7,
		["狂怒"] = 1,
		["扫击"] = 11,
		["世界放大器"] = 11,
		["虚空箭"] = "大法师阿鲁高",
		["暗影箭雨"] = "暗炉暗法师",
		["强效治疗石"] = 9,
		["火焰射击"] = "血色斥候",
		["圆弧斩"] = "暮光劫掠者",
		["法力之潮图腾"] = 7,
		["致残毒药"] = 4,
		["烈性炸药"] = 11,
		["治疗术"] = 5,
		["胁迫"] = 3,
		["制造尼姆布亚的长矛"] = 1,
		["考布莱恩毒蛇形态"] = "考布莱恩",
		["心灵之火"] = 5,
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["烈焰震击"] = 7,
		["火焰增效"] = "加加恩·火锤",
		["指挥地鼠"] = 5,
		["魔爆术"] = 8,
		["水上行走"] = 7,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["爪击"] = 11,
		["次级治疗波"] = 7,
		["剑刃乱舞"] = 4,
		["快速撕咬"] = "巨钳甲壳蟹",
		["快速射击"] = 3,
		["断筋"] = 1,
		["魔法增效"] = 8,
		["拳击"] = 1,
		["瘟疫之云"] = "圣甲虫",
		["冰霜冲击"] = 1,
		["遗弃技能：冰霜"] = 1,
		["恶魔皮肤"] = 9,
		["敏捷提高"] = 11,
		["反魔法盾"] = "影牙夜行者",
		["破甲"] = 4,
		["佯攻"] = 4,
		["宁静"] = 11,
		["偷袭"] = 4,
		["致伤毒药"] = 4,
		["冰柱"] = "加兹瑞拉",
		["反击风暴"] = 1,
		["火焰的召唤"] = "永醒的艾希尔",
		["火焰之盾效果 III"] = "血色招魂师",
		["旅行形态"] = 11,
		["暗影灼烧"] = 9,
		["召唤地鼠"] = 5,
		["野性冲锋"] = 11,
		["遗弃技能：防御"] = 11,
		["棕色科多兽"] = 11,
		["红色骸骨军马"] = 4,
		["火息术"] = "秘银幼龙 <血色布丁>",
		["往日的尖啸"] = "哀嚎的卫兵",
		["骷髅装束"] = 1,
		["火焰之盾 IV"] = "土灵雕刻者",
		["毒箭"] = 3,
		["扰乱"] = 4,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["闪电链"] = "斯卡姆",
		["致盲"] = 4,
		["厚丝质绷带"] = 4,
		["火焰新星"] = "火焰新星图腾 II <北凉一枝花>",
		["急速冷却"] = 8,
		["麻风侏儒装束"] = 9,
		["法力之矛"] = "卡尔加·刺肋",
		["毒蛇形态"] = "尖牙德鲁伊",
		["惩击"] = 5,
		["腐蚀术"] = 9,
		["横扫攻击"] = 1,
		["僵化"] = "苏利萨斯沙行者",
		["Dull Lure Spawn Effect"] = "活动假人 <血色布丁>",
		["侏儒死亡射线"] = 11,
		["猛禽一击"] = 3,
		["精神错乱"] = 9,
		["地狱火罩"] = "石窟织炎者",
		["治疗结界"] = "亡首先知",
		["火焰冲击"] = 8,
		["坚韧祷言"] = 5,
		["治疗之道"] = 7,
		["冰霜凝固"] = "加兹瑞拉",
		["速效毒药"] = 4,
		["冲锋"] = "野猪 <东乡一二三>",
		["纠缠根须"] = 11,
		["瞄准射击"] = 3,
		["召唤幻象之影"] = "鬼魅幻影",
		["遗弃技能：法杖"] = 1,
		["遗弃技能：双手锤"] = 1,
		["捕捉灵魂"] = 1,
		["旋风斩"] = 1,
		["局部毒药"] = "剧毒飞蛇",
		["遗弃技能：枪械"] = 11,
		["鬼魅灵魂"] = "鬼怪仆从",
		["生命"] = 8,
		["唤醒地灵宝库守卫"] = "阿扎达斯",
		["心灵震爆"] = 5,
		["先知药剂"] = 11,
		["恐惧术"] = 9,
		["制造初级灵魂石"] = 9,
		["防御姿态"] = 1,
		["水栖形态"] = 11,
		["恶魔践踏"] = "地狱战马",
		["反手一击"] = "碎骨统帅",
		["缴械"] = "邪蝠",
		["Drowning"] = "环境伤害 (溺水)",
		["恶魔支配"] = 9,
		["翻滚扫击"] = "邪蝠",
		["复仇"] = 1,
		["盾击"] = 1,
		["圣盾术"] = "指挥官斯普林瓦尔",
		["激活"] = 11,
		["被遗忘者的意志"] = 8,
		["消毒术"] = 11,
		["炸弹"] = "维格利",
		["还击"] = 4,
		["击退"] = "艾隆纳亚",
		["秘银机械幼龙"] = 11,
		["蝙蝠装束"] = 1,
		["召唤灰色座狼"] = "狼王南杜斯",
		["召唤小鬼"] = 9,
		["战栗图腾"] = 7,
		["肾击"] = 4,
		["无荣誉目标"] = 1,
		["遗弃技能：锤"] = 1,
		["暴怒"] = 1,
		["暗影易伤"] = 5,
		["奥术气泡"] = "奥法师杜安",
		["放置尼姆布亚的长矛"] = 9,
		["感染之伤"] = "祖尔法拉克阵亡英雄",
		["纯净术"] = "卡尔加·刺肋",
		["祛病术"] = 7,
		["熔岩喷射图腾"] = "亡首先知",
		["暗言术：痛"] = 5,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["灼烧"] = 8,
		["沙尘风暴"] = "古代的石头看守者",
		["暗棕狼"] = 7,
		["野性印记"] = 11,
		["治疗宠物"] = 3,
		["俯冲"] = "食腐鸟 <一百个飞机>",
		["撕裂"] = 1,
		["狂暴姿态"] = 1,
		["奥术智慧"] = 8,
		["爆炸陷阱效果"] = 3,
		["召唤不散的怨灵"] = 1,
		["惩罚光环"] = "血色十字军指挥官莫格莱尼",
		["重铸"] = "土灵筑厅师",
		["治疗祷言"] = 5,
		["枪械射击"] = 1,
		["喂养宠物"] = 3,
		["缩小"] = "格瑞姆洛克",
		["撕碎"] = 11,
		["圣光术"] = "指挥官斯普林瓦尔",
		["毒性唾液"] = "吞噬者芬鲁斯",
		["召唤战斗野猪"] = "剃刀沼泽驯兽师",
		["剥皮"] = 3,
		["槌击"] = 11,
		["盾牌专精"] = 1,
		["火焰新星图腾"] = 7,
		["火焰之盾效果 IV"] = "土灵雕刻者",
		["血色复活"] = "大检察官怀特迈恩",
		["反射"] = "玉脊蜥蜴",
		["附魔护腕 - 初级精神"] = 5,
		["怒不可遏"] = 1,
		["专注施法"] = 5,
		["Falling"] = "环境伤害 (高处坠落)",
		["拦截"] = 1,
		["强效法力药水"] = 7,
		["祛病图腾"] = 7,
		["黑暗契约"] = 9,
		["刺骨"] = 4,
		["自然抗性"] = 7,
		["风之优雅"] = 7,
		["树皮术"] = 11,
		["语言诅咒"] = 9,
		["残废术"] = "亡首通灵师",
		["诱惑"] = "尼姆艾斯 <火星星>",
		["侏儒作战小鸡"] = 11,
		["神圣之火"] = 5,
		["嗜血术"] = "驯犬者洛克希",
		["小鸡之怒"] = "作战小鸡",
		["冰锥术"] = 8,
		["血之诅咒"] = "阿迦玛甘之血",
		["自然抗性图腾"] = 7,
		["强效护甲"] = 1,
		["虚弱之触"] = 5,
		["食尸"] = 4,
		["!Autoshot"] = 8,
		["恐吓野兽"] = 3,
		["蝰蛇钉刺"] = 3,
		["诅咒增幅"] = 9,
		["精神控制"] = 5,
		["风怒武器"] = 7,
		["割裂"] = 4,
		["唤醒"] = 8,
		["打磨利刃"] = 1,
		["游泳速度"] = 1,
		["轻型护甲片"] = 3,
		["驱散魔法"] = 5,
		["暗影迷雾"] = "席瓦莱恩男爵",
		["绞喉"] = 4,
		["冰霜射击"] = "剃刀沼泽驯兽师",
		["统御意志"] = "亡语者贾格巴",
		["吸取灵魂"] = 9,
		["熔岩图腾"] = "熔岩图腾 <北凉一枝花>",
		["破甲虚弱"] = "觅血者",
		["魔法抑制"] = 8,
		["安抚之吻"] = "德鲁斯奈斯 <雀巢咖啡>",
		["奥术飞弹"] = 8,
		["烈焰打击"] = "土灵雕刻者",
		["凿击"] = 4,
		["红色焰火"] = 3,
		["制造次级治疗石"] = 9,
		["践踏"] = "加摩拉",
		["吸取生命"] = 9,
		["追踪野兽"] = 3,
		["兽群领袖"] = 11,
		["活动假人"] = 11,
		["造水术"] = 8,
		["次级隐形术"] = "德鲁斯奈斯 <雀巢咖啡>",
		["地震术"] = 7,
		["撕咬"] = "狼 <浅墨未央>",
		["天选印记效果"] = 4,
		["圣疗术"] = "血色十字军指挥官莫格莱尼",
		["冰冻陷阱效果"] = 3,
		["挫志咆哮"] = 11,
		["困兽之爪"] = "噬棘食尸鬼",
		["灵魂消耗"] = "雷希戈尔",
		["火舌攻击"] = 7,
		["驱毒术"] = 11,
		["地缚术"] = "地缚图腾 <花生不吃皮皮>",
		["蛛网"] = "墓穴劫掠者",
		["治疗之泉图腾"] = 7,
		["致命毒药 II"] = 4,
		["邪恶攻击"] = 4,
		["恢复"] = 5,
		["丝绸小包"] = 5,
		["回春术"] = 11,
		["自然之握"] = 11,
		["撕扯"] = 11,
		["束缚亡灵"] = 5,
		["盾墙"] = 1,
		["冲动"] = 4,
		["烈焰鞭笞"] = "暗炉地质学家",
		["眩晕"] = 3,
		["真言术：盾"] = 5,
		["先祖坚韧"] = 7,
		["强化治疗宠物"] = 3,
		["痛苦诅咒"] = 9,
		["解除诅咒"] = 11,
		["先祖之魂"] = 7,
		["骨甲术"] = "亡首通灵师",
		["闪现术"] = "院长",
		["补充法力"] = 8,
		["星火术"] = 11,
		["毒性喷溅"] = "变异剧毒风蛇",
		["火焰之雨"] = 9,
		["猎豹形态"] = 11,
		["侦测隐形"] = 9,
		["石盾术"] = 11,
		["愤怒"] = 11,
		["生命通道"] = 9,
		["生命分流"] = 9,
		["火焰之盾"] = 9,
		["地精暗雷"] = "维格利",
		["地狱烈焰效果"] = 9,
		["伤害增效"] = "骷髅暗影法师 <骷髅召唤者>",
		["月火术"] = 11,
		["呀啊啊啊啊"] = 3,
		["自爆"] = "奥法师杜安",
		["倒钩"] = "刺毛甲壳蟹",
		["防护暗影结界"] = 9,
		["扰乱射击"] = 3,
		["法力之泉图腾"] = 7,
		["虔诚光环"] = "剃刀沼泽卫兵",
		["死亡缠绕"] = 9,
		["制造次级灵魂石"] = 9,
		["地狱烈焰"] = 9,
		["复生"] = 11,
		["精灵之火（野性）"] = 11,
		["减速术"] = "暮光寻知者",
		["豹群守护"] = 3,
		["野性暴怒"] = "影牙暴怒者",
		["防护暗影"] = 5,
		["闪电蜥蜴"] = 2,
		["消失"] = 4,
		["召唤虚空行者"] = "暮光暗法师",
		["背刺"] = "剃刀沼泽捕猎者",
		["虚弱诅咒"] = "腐根巡影者",
		["烈焰尖刺"] = "血法师萨尔诺斯",
		["深度睡眠"] = "大检察官怀特迈恩",
		["制造治疗石"] = 9,
		["闪电之盾"] = 7,
		["猎人印记"] = 3,
		["唤醒地灵守护者"] = "阿扎达斯",
		["心灵专注"] = 5,
		["次级治疗术"] = 5,
		["法力之潮"] = "法力之潮图腾 II <花生不吃皮皮>",
		["吸取法力"] = 9,
		["作战鸣叫"] = "作战小鸡",
		["致密炸弹"] = 11,
		["遗弃技能：匕首"] = 7,
		["召唤风嚎者"] = "剃刀沼泽织尘者",
		["水晶沉睡"] = "玉脊蜥蜴",
		["挥击"] = 11,
		["照明弹"] = 3,
		["魔甲术"] = 9,
		["相位变换"] = "拉兹尤里 <火星星>",
		["蓝色骸骨军马"] = 4,
		["缠绕之藤"] = "永生者沃尔丹",
		["自然迅捷"] = 7,
		["智力"] = 9,
		["无敌"] = 1,
		["制造魔法翡翠"] = 8,
		["德鲁伊的睡眠"] = "尖牙德鲁伊",
		["雷霆震荡"] = "大法师阿鲁高",
		["冷血"] = 4,
		["吸血鬼的拥抱"] = 5,
		["风怒图腾"] = 1,
		["阿鲁高的诅咒"] = "大法师阿鲁高",
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = 1,
		["遗弃技能：剑"] = 11,
		["火焰之盾 III"] = "血色招魂师",
		["暗影冥思"] = 9,
		["恶性毒药"] = "墓穴劫掠者",
		["顺劈斩"] = 1,
		["恢复生命"] = 9,
		["灵魂链接"] = 9,
		["炉石"] = 1,
		["冰封武器"] = 7,
		["毁灭"] = "阿库麦尔钳嘴龟",
		["弓射击"] = 4,
	},
	["encounter_spell_pool"] = {
		{
			0, -- [1]
			"奥法师杜安", -- [2]
		}, -- [1]
		[0] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["冰霜凝固"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["唤醒地灵宝库守卫"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["火焰新星"] = {
			0, -- [1]
			"火眼莫德雷斯", -- [2]
		},
		["召唤黑曜石碎片"] = {
			0, -- [1]
			"黑曜石哨兵", -- [2]
		},
		["恢复"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["旋风斩"] = {
			0, -- [1]
			"赫洛德", -- [2]
		},
		["枯萎之触"] = {
			0, -- [1]
			"枯萎野猪人守卫", -- [2]
		},
		["圆弧斩"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["圣疗术"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["火焰新星图腾"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["打击"] = {
			0, -- [1]
			"土灵碎岩者", -- [2]
		},
		["治疗术"] = {
			0, -- [1]
			"大检察官法尔班克斯", -- [2]
		},
		["灵魂撕咬"] = {
			0, -- [1]
			"沙怒噬魂者", -- [2]
		},
		["寒冰箭"] = {
			0, -- [1]
			"寒冰之王亚门纳尔", -- [2]
		},
		["盾击"] = {
			0, -- [1]
			"暗炉伏击者", -- [2]
		},
		["圣盾术"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["缩小"] = {
			0, -- [1]
			"格瑞姆洛克", -- [2]
		},
		["火球术"] = {
			0, -- [1]
			"亡首地卜师", -- [2]
		},
		["击退"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["法力燃烧"] = {
			0, -- [1]
			"沙怒侍僧", -- [2]
		},
		["制裁之锤"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["火焰增效"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["真言术：盾"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["魔爆术"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["快速治疗"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["奥术气泡"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["急速冲锋"] = {
			0, -- [1]
			"埃瑞克", -- [2]
		},
		["大地震颤"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["盾牌猛击"] = {
			0, -- [1]
			"奥拉夫", -- [2]
		},
		["熔岩喷射图腾"] = {
			0, -- [1]
			"石窟智者", -- [2]
		},
		["暗言术：痛"] = {
			0, -- [1]
			"暗炉发掘者", -- [2]
		},
		["虚弱诅咒"] = {
			0, -- [1]
			"沙怒侍僧", -- [2]
		},
		["烈焰尖刺"] = {
			0, -- [1]
			"亡首地卜师", -- [2]
		},
		["十字军打击"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["沙尘风暴"] = {
			0, -- [1]
			"古代的石头看守者", -- [2]
		},
		["安图苏尔的治疗波"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["撒网"] = {
			0, -- [1]
			"图特卡什", -- [2]
		},
		["践踏"] = {
			0, -- [1]
			"宝库护卫者", -- [2]
		},
		["脚踢"] = {
			0, -- [1]
			"血色僧侣", -- [2]
		},
		["自爆"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["热疫"] = {
			0, -- [1]
			"耐克鲁姆", -- [2]
		},
		["烈焰打击"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"格瑞姆洛克", -- [2]
		},
		["烈焰震击"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["重铸"] = {
			0, -- [1]
			"土灵筑厅师", -- [2]
		},
		["瘟疫之云"] = {
			0, -- [1]
			"圣甲虫", -- [2]
		},
		["暗影箭"] = {
			0, -- [1]
			"沙怒暗影法师", -- [2]
		},
		["疾病之云"] = {
			0, -- [1]
			"暴食者", -- [2]
		},
		["僵化"] = {
			0, -- [1]
			"安图苏尔的仆从 <安图苏尔>", -- [2]
		},
		["地震术"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["减速术"] = {
			0, -- [1]
			"亡首地卜师", -- [2]
		},
		["陷地图腾"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"巴尔洛戈", -- [2]
		},
		["致命毒药"] = {
			0, -- [1]
			"石窟潜伏者", -- [2]
		},
		["召唤冰霜亡魂"] = {
			0, -- [1]
			"寒冰之王亚门纳尔", -- [2]
		},
		["沉默"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["吸血术"] = {
			0, -- [1]
			"沙怒饮血者", -- [2]
		},
		["背刺"] = {
			0, -- [1]
			"石窟伏击者", -- [2]
		},
		["水晶沉睡"] = {
			0, -- [1]
			"玉脊蜥蜴", -- [2]
		},
		["驱散魔法"] = {
			0, -- [1]
			"大检察官法尔班克斯", -- [2]
		},
		["深度睡眠"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["唤醒地灵守护者"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["血色复活"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["反射"] = {
			0, -- [1]
			"玉脊蜥蜴", -- [2]
		},
		["安图苏尔的爪牙"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["黑暗祭品"] = {
			0, -- [1]
			"沙怒噬魂者", -- [2]
		},
		["缴械"] = {
			0, -- [1]
			"暗炉伏击者", -- [2]
		},
		["挥砍"] = {
			0, -- [1]
			"乌克兹·沙顶", -- [2]
		},
		["神圣打击"] = {
			0, -- [1]
			"血色勇士", -- [2]
		},
		["狂暴姿态"] = {
			0, -- [1]
			"沙怒刽子手", -- [2]
		},
		["土灵卫士被摧毁"] = {
			0, -- [1]
			"土灵筑厅师", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"寒冰之王亚门纳尔", -- [2]
		},
		["恶性毒药"] = {
			0, -- [1]
			"图特卡什", -- [2]
		},
		["Warder Despawn"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"血色百夫长", -- [2]
		},
		["祖穆拉恩结界"] = {
			0, -- [1]
			"巫医祖穆拉恩", -- [2]
		},
		["图特卡什的诅咒"] = {
			0, -- [1]
			"图特卡什", -- [2]
		},
		["血之诅咒"] = {
			0, -- [1]
			"大检察官法尔班克斯", -- [2]
		},
		["战争践踏"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["妖术"] = {
			0, -- [1]
			"沙怒暗影猎手", -- [2]
		},
		["统御意志"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["冰霜射击"] = {
			0, -- [1]
			"泽雷利斯", -- [2]
		},
		["黑曜石破碎"] = {
			0, -- [1]
			"黑曜石哨兵", -- [2]
		},
		["冰柱"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"鲁维罗什", -- [2]
		},
		["痛击"] = {
			0, -- [1]
			"血色僧侣", -- [2]
		},
		["火焰之盾效果 IV"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["旋风斩效果"] = {
			0, -- [1]
			"赫洛德", -- [2]
		},
		["烈焰鞭笞"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["防御姿态"] = {
			0, -- [1]
			"暗炉伏击者", -- [2]
		},
		["圣光击"] = {
			0, -- [1]
			"大检察官怀特迈恩", -- [2]
		},
		["闪电箭"] = {
			0, -- [1]
			"鲁维罗什", -- [2]
		},
		["腐烂恶臭"] = {
			0, -- [1]
			"腐烂的普雷莫尔", -- [2]
		},
		["火焰之盾 IV"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["投网"] = {
			0, -- [1]
			"泽雷利斯", -- [2]
		},
		["惩罚光环"] = {
			0, -- [1]
			"血色十字军指挥官莫格莱尼", -- [2]
		},
		["顺劈斩"] = {
			0, -- [1]
			"赫洛德", -- [2]
		},
		["!Melee"] = {
			0, -- [1]
			"奥法师杜安", -- [2]
		},
		["闪电之盾"] = {
			0, -- [1]
			"石窟智者", -- [2]
		},
		["心灵尖啸"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["战栗图腾"] = {
			0, -- [1]
			"格瑞姆洛克", -- [2]
		},
		["治疗结界"] = {
			0, -- [1]
			"石窟智者", -- [2]
		},
		["狂怒"] = {
			0, -- [1]
			"赫洛德", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [1]
		{
			1, -- [1]
			1, -- [2]
			3, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [2]
	},
	["__profiles"] = {
		["头哥-觅心者"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.249999985098839,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["data_broker_text"] = "",
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -377.296924591064,
							["x"] = 656.85302734375,
							["w"] = 190.691543579102,
							["h"] = 89.2590942382813,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = false,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 4.74021244049072,
						["x"] = -6.3197021484375,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["grab_on_top"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["show_sidebars"] = false,
					["skin_custom"] = "",
					["backdrop_texture"] = "Details Ground",
					["switch_damager_in_combat"] = false,
					["switch_tank_in_combat"] = false,
					["bars_sort_direction"] = 1,
					["auto_current"] = true,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["bars_inverted"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -377.296924591064,
							["x"] = 656.85302734375,
							["w"] = 190.691543579102,
							["h"] = 89.2590942382813,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 0,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 11,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["use_spec_icons"] = true,
						["font_size"] = 16,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["textR_bracket"] = "(",
						["textR_enable_custom_text"] = false,
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["percent_type"] = 1,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["height"] = 16,
					},
					["bars_grow_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["micro_displays_side"] = 2,
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["desaturated_menu"] = false,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["total_abbreviation"] = 2,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = true,
				["minimapPos"] = 204.024159583467,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["broadcaster_enabled"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["pvp_as_group"] = true,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["clear_ungrouped"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["time_type"] = 2,
			["time_type_original"] = 2,
			["default_bg_alpha"] = 0.5,
			["overall_flag"] = 16,
		},
		["Tyjj-奎尔塞拉"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -347.666694641113,
							["x"] = 603.518432617188,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textAlign"] = 0,
								["textXMod"] = 6,
								["textStyle"] = 2,
								["textFace"] = "Accidental Presidency",
								["timeType"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["switch_damager"] = false,
					["switch_all_roles_after_wipe"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["switch_tank"] = false,
					["hide_in_combat_alpha"] = 0,
					["skin_custom"] = "",
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 0,
						["x"] = 0,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\BigWigs\\Media\\Textures\\BantoBar",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["texture_custom_file"] = "Interface\\",
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
					},
					["bars_grow_direction"] = 1,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["switch_tank_in_combat"] = false,
					["bars_inverted"] = false,
					["auto_current"] = true,
					["clickthrough_rows"] = false,
					["version"] = 3,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -347.666694641113,
							["x"] = 603.518432617188,
							["w"] = 310.000061035156,
							["h"] = 157.999984741211,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["backdrop_texture"] = "Details Ground",
					["bars_sort_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["micro_displays_side"] = 2,
					["menu_icons_size"] = 0.850000023841858,
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 18,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["segments_auto_erase"] = 1,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
		},
	},
	["disable_talent_feature"] = false,
	["spell_school_cache"] = {
		["毒性射击"] = 8,
		["!Melee"] = 1,
		["投掷"] = 1,
		["魔爆术"] = 64,
		["射击"] = 1,
		["痛击"] = 1,
		["Corpo-a-Corpo"] = 1,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_size"] = 12,
		["damage_taken_shadow"] = true,
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["always_use_profile"] = false,
	["global_plugin_database"] = {
	},
	["switchSaved"] = {
		["slots"] = 8,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
		},
	},
	["realm_sync"] = true,
	["createauraframe"] = {
		["y"] = -3.8146972656250e-06,
		["x"] = -9.15527343750e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["item_level_pool"] = {
		["Player-4780-0060B350"] = {
			["time"] = 1572885737,
			["name"] = "头哥",
			["ilvl"] = 0,
		},
		["Player-4780-006D12C7"] = {
			["time"] = 1572882686,
			["name"] = "血色布丁",
			["ilvl"] = 0,
		},
	},
	["report_where"] = "PARTY",
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["update_warning_timeout"] = 10,
	["latest_news_saw"] = "",
	["raid_data"] = {
	},
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 443,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["MIN_COMBAT_TIME"] = true,
		["DETAILS_INFO_TUTORIAL2"] = 10,
		["OVERALLDATA_WARNING1"] = 22,
		["logons"] = 443,
		["version_announce"] = 0,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["ctrl_click_close_tutorial"] = false,
		["OPTIONS_PANEL_OPENED"] = true,
		["bookmark_tutorial"] = false,
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["show_totalhitdamage_on_overkill"] = false,
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -5.72204589843750e-05,
		["x"] = 58.4691772460938,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [1]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of crowd control received for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["spellid"] = false,
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [2]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["name"] = "我的技能",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 8,
		}, -- [3]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["name"] = "对骷髅标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["name"] = "对其它标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["name"] = "有使用药水",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["attribute"] = false,
			["script_version"] = 5,
		}, -- [6]
		{
			["source"] = false,
			["total_script"] = false,
			["author"] = "Details! Team",
			["percent_script"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["spellid"] = false,
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["attribute"] = false,
			["script_version"] = 15,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["spellid"] = false,
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["spellid"] = false,
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show overall damage done on the fly.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n				    local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n				    OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n				    s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n				    s = ToK (_, value) .. \" (\" .. s\n				end\n\n				return s\n			",
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["spellid"] = false,
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n					local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n					AllSpells [spellName] = spellTable.total\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n\n			",
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n				    return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					instance_container:AddValue (player, player.total)\n				    end\n				end\n\n				if (Details.in_combat) then\n				    for _, player in ipairs ( damage_container_current ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n					    instance_container:AddValue (player, player.total)        \n					end\n				    end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 5,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["name"] = "对护盾造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["mobs_data_compiled"] = {
	},
	["lastUpdateWarning"] = 1572183946,
	["mobs_data"] = {
	},
}
